{
"title": "More room for real estate",
"content": "We believe the U.S. commercial real estate recovery has room to run. Richard explains why with the help of this week’s chart."
},{
"title": "Health care stocks that are good for you",
"content": "A dynamic of haves versus have-nots means that health care is increasingly all about stock picking. Kate sees opportunities in biotech, medical devices, U.S. managed care and selected big pharma with promising drug pipelines."
},{
"title": "The faces behind the ETF growth phenomenon",
"content": "ETF investors may have some unique characteristics, BlackRock's new ETF Pulse survey shows. "
},{
"title": "2 new views for the second quarter",
"content": "We are downgrading European sovereign bonds and credit to underweight as the second quarter begins. Richard explains, with the help of this week’s chart."
},{
"title": "Hello higher rates, but not goodbye reflation",
"content": "The Federal Reserve has engineered a turnaround in March hike expectations, but Richard explains why we do not see gradually rising rates derailing reflation for now. "
},{
"title": "It’s time to ace retirement",
"content": "Many people have doubts about whether or not they would have enough saved up for retirement. Here are some things you can do to keep those doubts in check. "
},{
"title": "The next election shock?",
"content": "Markets are anxious about upcoming European elections, but Richard Turnill explains why near-term political risks are probably overstated. "
},{
"title": "Opportunities amid the oil dip",
"content": "A recent drop in energy-related assets appears overdone given our outlook for oil prices, creating opportunities in selected energy equities and credit. Richard explains, with the help of this week’s chart."
},{
"title": "China’s economy improves amid trade tension",
"content": "Should potential trade frictions between the U.S. and China worry investors during the Year of the Rooster? Andrew Swan breaks it down for investors. "
},{
"title": "Mardi Gras markets?",
"content": "Animal spirits rule the markets these days. But does a period of penance await? Heidi discusses. "
},{
"title": "Improve the retirement equation",
"content": "Different generations today face the same challenge of trying to save for retirement in a low return market environment. Anne shares some tips on what to do. "
},{
"title": "10 surprising facts about HYG",
"content": "The market’s first high yield bond ETF turns 10, and there is a lot about the fund that you may not know."
},{
"title": "3 investing themes for the second quarter",
"content": "Richard shares three interrelated themes that are likely to shape investing this quarter."
},{
"title": "Good tax, bad tax and ETFs",
"content": "Taxes are inevitable, but investors can try to minimize how much they pay on their investments by using ETFs. Martin explains. "
},{
"title": "How to think about retirement savings realistically",
"content": "Professor Sheena Iyengar of the Columbia Business School believes in a less abstract, more visual approach in improving retirement savings. "
},{
"title": "Sectors to follow in Q2",
"content": "The markets had a rocky start in 2016, but ended the first quarter with a broad rally. So what sectors are best positioned for the next three months? Heidi Richardson shares her take."
},{
"title": "Why retirement planning should start at birth",
"content": "BlackRock’s Chip Castille talks to Tony Stenning, BlackRock’s Head of Retirement in EMEA, to get his interesting perspective on why it’s never too early to start saving for your golden years."
},{
"title": "The seesaw relationship of volatility and momentum stocks",
"content": "Volatility is creeping back into the markets. Russ discusses why that holds some peril for momentum stocks."
},{
"title": "Top 4 retirement saving ideas",
"content": "Here are some simple steps you can take toward retirement readiness. Anne explains. "
},{
"title": "Let’s retire retirement",
"content": "At a recent BlackRock Retirement Roundtable, Stanford's Laura Carstensen, Encore's Marc Freedman and Brookings' Josh Gotbaum discussed the different ways that our current concept of “retirement" is outmoded."
},{
"title": "What does the SF Bay Bridge have to do with bond investing?",
"content": "With the recent increase in short-term rates by the Federal Reserve, it’s a good time to go over what the yield curve is and what it says about the fixed income investment environment."
},{
"title": "3 ways your retirement will be different from your parents’",
"content": "BlackRock's Chip Castille takes a closer look at today's retirement landscape and uncovers several underlying themes that will transform how people around the globe prepare for their golden years."
},{
"title": "5 questions to ask your advisor about ETFs",
"content": "More and more investors are looking at ETFs and wondering if they should incorporate them in their portfolios. Talking to your financial advisors about ETFs is a good start. "
},{
"title": "Spring training",
"content": "Heidi discusses whether optimism or sober assessment of valuations and political realities can prevail in the markets."
},{
"title": "iShares min vol ETFs: passing the five-year test",
"content": "Sara Shores examines the performance of the iShares minimum volatility ETFs and reasons why investors should consider them for the long term."
},{
"title": "After Brexit begins, a slowdown ahead?",
"content": "The UK is set to formally begin the Brexit process this week. Isabelle explains what this could mean for the UK economy and markets."
},{
"title": "Inflation comes skulking back",
"content": "Russ discusses the signs that inflation is rising faster than many expect, and what that means for your portfolio. "
},{
"title": "Why reflation has room to run",
"content": "The recent jump in global bond yields represents a reflationary reawakening just a year after deflation and recession fears were dominant. Jean explains why this phase has further to run. "
},{
"title": "Regional banks: A league of their own?",
"content": "The Trump administration is promising to cut financial deregulations. Heidi discusses why this could help regional banks in particular."
},{
"title": "Navigating the Trump dollar rally",
"content": "Heidi explains the importance of why—and where—the U.S. dollar is rallying. "
},{
"title": "4 ways to go “pro” with ETFs",
"content": "Exchange-traded funds are popular with many big institutional investors. A look into why can give every investor something to think about. "
},{
"title": "3 ways to prime a portfolio with ETFs for 2017",
"content": "Building a portfolio can be a daunting task, especially at an economic and political turning point like now. Here are three things that investors can consider doing to start the new year."
},{
"title": "The many faces of EM investing",
"content": "Investors should think of emerging markets as individual countries with distinct opportunities and take into account the disparate economic drivers and prospects that make up the category. "
},{
"title": "What the Fed’s hike means for markets",
"content": "We see market complacency as a risk as the Federal Reserve normalizes its pace of normalization. Jeff explains."
},{
"title": "To hedge or not to hedge?",
"content": "Although the value of a currency can impact your international holdings, Russ talks about when it makes sense to hedge that effect."
},{
"title": "A side effect of China’s debt binge",
"content": "Richard explains why China has declined in our latest BlackRock Sovereign Risk Index (BSRI) rankings and names some of the biggest movers this quarter."
},{
"title": "Why a March hike is on the table",
"content": "Rick Rieder shares three reasons why a March Fed rate increase is a possibility."
},{
"title": "What to look for from the Fed",
"content": "With most market participants expecting a hold on interest rates at the Fed’s April meeting, Matt Tucker looks beyond the rate-hike decision in this post."
},{
"title": "Maintaining human interaction in a robo-care world",
"content": "At a recent BlackRock Retirement Roundtable in London, Matt Cullen, Head of Strategy for the Association of British Insurers, talked about the importance of human contact to maintain good health as we age."
},{
"title": "A New Year’s resolution you’ll actually keep",
"content": "Six steps an investor can take today to improve financial well-being and be a more confident retirement saver in 2017. "
},{
"title": "A conversation about technology, robotics and retirement",
"content": "At a recent BlackRock Retirement Roundtable in Tokyo, Chip Castille spoke with Yoshiyuki Sankai, CEO of CYBERDYNE, Inc. We like to say that the retirement challenge is about more than money. But robot suits? Read on."
},{
"title": "Europe, not just a vacation opportunity",
"content": "Heidi discusses the case for eurozone equities, despite the abundance of political uncertainties. "
},{
"title": "3 common mistakes investors make with their bond portfolio",
"content": "Bond investing is not easy, but avoiding the most commonly made mistakes can be. Matt explains."
},{
"title": "Are U.S. banks still cheap?",
"content": "Financial stocks have been rallying on the expectations of higher interest rates and less regulation. Russ discusses whether the good news has already been priced in. "
},{
"title": "Why markets may be wrong about Europe",
"content": "We believe markets appear too pessimistic on Europe’s outlook—a big reason why we are positive on European stocks. Jean explains."
},{
"title": "Assumptions not to make after the March Fed hike",
"content": "With two more Fed hikes potentially on the horizon in 2017, Rick clears up a few wrong assumptions some market watchers are making about rate normalization."
},{
"title": "China’s role in global growth",
"content": "Jean explains what our new China GPS economic indicator can tell us about the outlook for China's role in global growth."
},{
"title": "Why opportunities abound for active bond investors",
"content": "Rick shares two reasons why we see abundant fixed income opportunities."
},{
"title": "Why all investors should care about China",
"content": "Isabelle Mateos y Lago puts China in context, showing just how important it has become for the global economy. "
},{
"title": "China on an upswing",
"content": "Richard explains why sentiment on China has become positive, as well as its market implications."
},